---
kind: method
id: M:Autodesk.Revit.DB.ExportLinetypeTableIterator.Dispose
source: html/c003659a-6b76-8412-ba92-1971a40c1ef7.htm
---
# Autodesk.Revit.DB.ExportLinetypeTableIterator.Dispose Method

Releases all resources used by the ExportLinetypeTableIterator

## Syntax (C#)
```csharp
public void Dispose()
```